app/controllers/api/v1/memes_controller.rb

SELECT  "memes".* FROM "memes" WHERE "memes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_meme
      @meme = Meme.find(params[:id])