app/controllers/api/v1/stations_controller.rb

SELECT "stations".* FROM "stations"
---
  def index
    @stations = Station.all

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_station
      @station = Station.find(params[:id])